zglue/zglue_nuttx/arch/arm/src/nrf52/nrf52_spi_legacy.c
/****************************************************************************
 * arch/arm/src/nrf52/nrf52_spi_legacy.c
 *
 *   Copyright (C) 2009-2013, 2016 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *   Copyright (C) 2017 Zglue  Inc. All rights reserved.
 *           Levin Li     <zhiqiang@zglue.com>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/wdog.h>
#include <nuttx/semaphore.h>
#include <nuttx/spi/spi.h>
#include <nuttx/spi/spi_transfer.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "chip.h"
#include "up_arch.h"
#include "up_internal.h"
#include "nrf.h"
#include "nrf_spi.h"
#include "nrf52_gpio.h"
#include "nrf52_spi.h"


#if defined(CONFIG_NRF52_LEGACY_SPI0) || defined(CONFIG_NRF52_LEGACY_SPI1) || defined(CONFIG_NRF52_LEGACY_SPI2)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/
#define NRF_DRV_SPI_PIN_NOT_USED  0xFF

#ifndef NRF_SPI_PIN_NOT_CONNECTED
#define NRF_SPI_PIN_NOT_CONNECTED  0xFFFFFFFF
#endif

#define NRF52_SPI0_CLK_FREQUENCY  NRF_SPI_FREQ_8M

#define NRF52_SPI1_CLK_FREQUENCY  NRF_SPI_FREQ_8M

#define NRF52_SPI2_CLK_FREQUENCY  NRF_SPI_FREQ_8M

// All interrupt flags
#define DISABLE_ALL_INT_SHORT  0xFFFFFFFF

#define NRF52_SPI_MAX_TRANSFER_LEN  0xFF
#define NRF52_SPI_ONCE_TRANSFER_LEN 0x80

/* Note:
 *    Nordic tx / rx buffer accept the max transfer data is 255 byte.
 *    You can check datasheet by 31.6.14 TXD.MAXCNT Address offset: 0x548
 *    they support double buffer feature , but now this driver not use double buffer
 *    feature
 *    another feature is DMA list ,  now we don't use it
 */

/****************************************************************************
 * Private Types
 ****************************************************************************/

/**
 * @brief Single transfer descriptor structure.
 */
typedef struct
{
  uint8_t const *p_tx_buffer;  ///< Pointer to TX buffer.
  uint8_t        *p_rx_buffer; ///< Pointer to RX buffer.
  uint32_t          tx_length;   ///< TX buffer length.
  uint32_t          rx_length;   ///< RX buffer length.
} nrf_spi_xfer_desc_t;

struct legacy_spidev_s
{
  struct spi_dev_s          spidev;     /* Generic SPI device */
  unsigned int              base;       /* Base address of registers */
  uint16_t                  irqid;      /* IRQ for this device */
  uint8_t                   busid;
  sem_t                     mutex;      /* Only one thread can access at a time */
#ifdef CONFIG_NRF52_SPI_INTERRUPTS
  xcpt_t                    isr;      /* Interrupt handler */
  sem_t                     wait;       /* Interrupt wait semaphore */
#endif
  nrf_spi_frequency_t       frequency;  /* Current SPI frequency */
  uint32_t                  mode;       /* Current SPI frequency */
  nrf_spi_bit_order_t       bit_order;  /* Current SPI frequency */
  uint8_t                   orc;        /* < Over-run character.
                                         **< This character is used when all bytes from the TX buffer are sent,
                                         *but the transfer continues due to RX. */
  nrf_spi_xfer_desc_t       xfer_desc;
  uint32_t                  transferred;
  nrf_drv_state_t           state;
  struct spi_pinmux_t       *pinmux;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static uint32_t legacy_spi_setfrequency(FAR struct spi_dev_s *dev,
                                        uint32_t frequency);
void legacy_spi_select(FAR struct spi_dev_s *dev, uint32_t devid, bool selected);
/* SPI device operations */
static int legacy_spi_lock(FAR struct spi_dev_s *dev, bool lock);
static void legacy_spi_setmode(FAR struct spi_dev_s *dev, enum spi_mode_e mode);
static uint16_t legacy_spi_send(FAR struct spi_dev_s *dev, uint16_t wd);

#ifdef CONFIG_SPI_EXCHANGE
static void legacy_spi_exchange(FAR struct spi_dev_s *dev,
                                FAR const void *txbuffer, FAR void *rxbuffer,
                                size_t nwords);
#else
static void legacy_spi_sndblock(FAR struct spi_dev_s *dev,
                                FAR const void *txbuffer, size_t nwords);
static void legacy_spi_recvblock(FAR struct spi_dev_s *dev,
                                 FAR void *buffer, size_t nwords);
#endif

#ifdef CONFIG_SPI_RESET
static int  legacy_spi_reset(FAR struct spi_dev_s *dev);
#endif

#ifdef CONFIG_NRF52_SPI_INTERRUPTS
static int  legacy_spi_interrupt_handler(int irq, void *context, FAR void *arg);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/
struct spi_ops_s legacy_spi_ops =
{
  .lock              = legacy_spi_lock,
  .setfrequency      = legacy_spi_setfrequency,
  .setmode           = legacy_spi_setmode,
  .setbits           = NULL,
  .select            = legacy_spi_select,
  .send              = legacy_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = legacy_spi_exchange,
#else
  .sndblock          = legacy_spi_sndblock,
  .recvblock         = legacy_spi_recvblock,
#endif
#ifdef CONFIG_SPI_RESET
  .reset             = legacy_spi_reset
#endif
};

#ifdef CONFIG_NRF52_LEGACY_SPI0
static const struct spi_pinmux_t spi0_pinmux =
{
  .cs_pin     = BOARD_SPI0_CS_PIN,
  .miso_pin   = BOARD_SPI0_MISO_PIN,
  .mosi_pin   = BOARD_SPI0_MOSI_PIN,
  .sck_pin    = BOARD_SPI0_SCL_PIN,
};

static struct legacy_spidev_s g_spi0 =
{
  .spidev     = { &legacy_spi_ops },
  .base       = NRF_SPIM0_BASE,
  .irqid      = NRF52_IRQ_SPI_TWI_0,
  .busid      = SPI_NRF52_BUS_0,
  .frequency  = NRF52_SPI0_CLK_FREQUENCY,
  .mode       = NRF_SPI_MODE_0,
  .orc        = 0xA5,
  .bit_order  = NRF_SPI_BIT_ORDER_MSB_FIRST,
#ifdef CONFIG_NRF52_SPI_INTERRUPTS
  .isr        = legacy_spi_interrupt_handler,
#endif
  .pinmux     = (struct spi_pinmux_t *) &spi0_pinmux
};
#endif

