zglue/zglue_nuttx/arch/arm/src/nrf52/nrf52_spi_legacy.c
#ifdef CONFIG_NRF52_SPI1
static const struct spi_pinmux_t spi1_pinmux =
{
  .cs_pin     = BOARD_SPI1_CS_PIN,
  .miso_pin   = BOARD_SPI1_MISO_PIN,
  .mosi_pin   = BOARD_SPI1_MOSI_PIN,
  .sck_pin    = BOARD_SPI1_SCL_PIN,
};

static struct legacy_spidev_s g_spi1 =
{
  .spidev     = { &legacy_spi_ops },
  .base       = NRF_SPIM1_BASE,
  .irqid      = NRF52_IRQ_SPI_TWI_1,
  .busid      = SPI_NRF52_BUS_1,
  .frequency  = NRF52_SPI1_CLK_FREQUENCY,
  .mode       = NRF_SPI_MODE_0,
  .orc        = 0xA5,
  .bit_order  = NRF_SPI_BIT_ORDER_MSB_FIRST,

#ifdef CONFIG_NRF52_SPI_INTERRUPTS
  .isr        = legacy_spi_interrupt_handler,
#endif
  .pinmux     = (struct spi_pinmux_t *) &spi1_pinmux
};
#endif

#ifdef CONFIG_NRF52_LEGACY_SPI2

static const struct spi_pinmux_t spi2_pinmux =
{
  .cs_pin     = BOARD_SPI2_CS_PIN,
  .miso_pin   = BOARD_SPI2_MISO_PIN,
  .mosi_pin   = BOARD_SPI2_MOSI_PIN,
  .sck_pin    = BOARD_SPI2_SCL_PIN,
};

static struct legacy_spidev_s g_spi2 =
{
  .spidev     = { &legacy_spi_ops },
  .base       = NRF_SPIM2_BASE,
  .irqid      = NRF52_IRQ_SPI2,
  .busid      = SPI_NRF52_BUS_2,
  .frequency  = NRF52_SPI2_CLK_FREQUENCY,
  .mode       = NRF_SPI_MODE_0,
  .orc        = 0xA5,
  .bit_order  = NRF_SPI_BIT_ORDER_MSB_FIRST,

#ifdef CONFIG_NRF52_SPI_INTERRUPTS
  .isr        = legacy_spi_interrupt_handler,
#endif
  .pinmux     = (struct spi_pinmux_t *) &spi2_pinmux
};
#endif

#ifdef CONFIG_NRF52_CS_CONTROL_BY_USER
static SPI_CS_CallBack g_cs_select;
#endif
/******************************************************************************
 * Private Functions
 *****************************************************************************/


/****************************************************************************
 * Name: legacy_spi_setfrequency
 *
 * Description:
 *   Set the frequency for the next transfer
 *
 ****************************************************************************/
static uint32_t legacy_spi_setfrequency(FAR struct spi_dev_s *dev,
                                        uint32_t frequency)
{
  struct legacy_spidev_s *priv = (struct legacy_spidev_s *) dev;
  NRF_SPI_Type *p_spi = (NRF_SPI_Type *)priv->base;
  uint32_t freq_k ;

  freq_k = frequency / 1000;

  switch (freq_k)
    {
      case 125:
        priv->frequency = NRF_SPI_FREQ_125K;
        break;
      case 250:
        priv->frequency = NRF_SPI_FREQ_250K;
        break;
      case 500:
        priv->frequency = NRF_SPI_FREQ_500K;
        break;
      case 1000:
        priv->frequency = NRF_SPI_FREQ_1M;
        break;
      case 2000:
        priv->frequency = NRF_SPI_FREQ_2M;
        break;
      case 4000:
        priv->frequency = NRF_SPI_FREQ_4M;
        break;
      case 8000:
        priv->frequency = NRF_SPI_FREQ_8M;
        break;
      default:
        spierr("Legacy: Invalid Parameter for SPI frequency , %d\n", frequency);
        return -EINVAL;
        break;
    }
  nrf_spi_frequency_set(p_spi, (nrf_spi_frequency_t)priv->frequency);

  return frequency;
}

/****************************************************************************
 * Name: legacy_spi_select
 *
 * Description:
 *   Set the frequency for the next transfer
 *
 ****************************************************************************/
void legacy_spi_select(FAR struct spi_dev_s *dev, uint32_t devid, bool selected)
{
  struct legacy_spidev_s *priv = (struct legacy_spidev_s *) dev;

#ifdef CONFIG_NRF52_CS_CONTROL_BY_USER

  if (NULL == g_cs_select)
    {
      spierr("Please register customized  CS select API.\n");
      return;
    }

  g_cs_select(priv->busid, devid, selected);

#else

  struct spi_pinmux_t *pinmux = priv->pinmux;

  if (selected == true)
    {
      if (pinmux->cs_pin != NRF52_INVALID_GPIO_PIN)
        {
          nrf52_gpio_write(pinmux->cs_pin, true);
        }
    }
  else
    {
      if (pinmux->cs_pin != NRF52_INVALID_GPIO_PIN)
        {
          nrf52_gpio_write(pinmux->cs_pin, false);
        }
    }
#endif
}

/*****************************************************************************
 * Name: legacy_spi_setmode
 *
 * Description:
 *   Set the frequency for the next transfer
 *
 ****************************************************************************/
static void legacy_spi_setmode(FAR struct spi_dev_s *dev,
                               enum spi_mode_e mode)
{
  struct legacy_spidev_s *priv = (struct legacy_spidev_s *) dev;
  NRF_SPI_Type *p_spi = (NRF_SPI_Type *)priv->base;
  uint32_t config = p_spi->CONFIG;
  switch (mode)
    {
      case SPIDEV_MODE0:
        config |= (SPIM_CONFIG_CPOL_ActiveHigh << SPIM_CONFIG_CPOL_Pos) |
                  (SPIM_CONFIG_CPHA_Leading    << SPIM_CONFIG_CPHA_Pos);
        break;
      case SPIDEV_MODE1:
        config |= (SPIM_CONFIG_CPOL_ActiveHigh << SPIM_CONFIG_CPOL_Pos) |
                  (SPIM_CONFIG_CPHA_Trailing   << SPIM_CONFIG_CPHA_Pos);
        break;
      case SPIDEV_MODE2:
        config |= (SPIM_CONFIG_CPOL_ActiveLow  << SPIM_CONFIG_CPOL_Pos) |
                  (SPIM_CONFIG_CPHA_Leading    << SPIM_CONFIG_CPHA_Pos);
        break;
      case SPIDEV_MODE3:
        config |= (SPIM_CONFIG_CPOL_ActiveLow  << SPIM_CONFIG_CPOL_Pos) |
                  (SPIM_CONFIG_CPHA_Trailing   << SPIM_CONFIG_CPHA_Pos);
        break;
    }
  p_spi->CONFIG = config;
}

/******************************************************************************
 * Name: legacy_spi_lock
 *
 * Description:
 *   On SPI busses where there are multiple devices, it will be necessary to
 *   lock SPI to have exclusive access to the busses for a sequence of
 *   transfers.  The bus should be locked before the chip is selected. After
 *   locking the SPI bus, the caller should then also call the setfrequency,
 *   setbits, and setmode methods to make sure that the SPI is properly
 *   configured for the device.  If the SPI buss is being shared, then it
 *   may have been left in an incompatible state.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock spi bus, false: unlock SPI bus
 *
 * Returned Value:
 *   None
 *
 *****************************************************************************/

static int legacy_spi_lock(FAR struct spi_dev_s *dev, bool lock)
{
  FAR struct legacy_spidev_s *priv = (FAR struct legacy_spidev_s *)dev;

  if (lock == true)
    {
      /* Take the semaphore (perhaps waiting) */
      while (sem_wait(&priv->mutex) != 0)
        {
          /* The only case that an error should occur here is if the wait
           * was awakened by a signal.
           */

          ASSERT(errno == EINTR);
        }
    }
  else
    {
      (void)sem_post(&priv->mutex);
    }
  return OK;
}


