zglue/zglue_nuttx/arch/arm/src/nrf52/nrf52_spi_legacy.c
/* This function is called from IRQ handler or, in blocking mode, directly
 * from the 'nrf_drv_spi_transfer' function.
 * It returns true as long as the transfer should be continued, 
 * otherwise (whenthere is nothing more to send/receive) it returns false.
 ***************************************************************************/
static bool transfer_byte(FAR struct legacy_spidev_s *priv, NRF_SPI_Type *p_spi)
{
  /* Read the data byte received in this transfer and store it in RX buffer,
   * if needed.
   ************************************************************************/
  volatile uint8_t rx_data = nrf_spi_rxd_get(p_spi);
  if (priv->transferred < priv->xfer_desc.rx_length)
    {
      priv->xfer_desc.p_rx_buffer[priv->transferred] = rx_data;
    }

  ++priv->transferred;

  /* Check if there are more bytes to send or receive and write proper data
   * byte (next one from TX buffer or over-run character) to the TXD register
   * when needed.
   * NOTE - we've already used 'p_cb->bytes_transferred + 1' bytes from our
   *        buffers, because we take advantage of double buffering of TXD
   *        register (so in effect one byte is still being transmitted now);
   *        see how the transfer is started in the 'nrf_drv_spi_transfer'
   *        function.
   *************************************************************************/
  uint16_t bytes_used = priv->transferred + 1;

  if (bytes_used < priv->xfer_desc.tx_length)
    {
      nrf_spi_txd_set(p_spi, priv->xfer_desc.p_tx_buffer[bytes_used]);
      return true;
    }
  else if (bytes_used < priv->xfer_desc.rx_length)
    {
      nrf_spi_txd_set(p_spi, priv->orc);
      return true;
    }

  return (priv->transferred < priv->xfer_desc.tx_length ||
          priv->transferred < priv->xfer_desc.rx_length);
}

/******************************************************************************
 * Name: nrf_spi_xfer
 *
 * Description:
 *   Take the exclusive access, waiting as necessary
 *
 ******************************************************************************/
static ret_code_t nrf_spi_xfer(FAR struct legacy_spidev_s *priv,
                               NRF_SPI_Type                 *p_spi,
                               nrf_spi_xfer_desc_t const *p_xfer_desc)
{
  ret_code_t err_code;

  nrf_spi_int_disable(p_spi, NRF_SPI_INT_READY_MASK);
  nrf_spi_event_clear(p_spi, NRF_SPI_EVENT_READY);


  /* Start the transfer by writing some byte to the TXD register;
   * if TX buffer is not empty, take the first byte from this buffer,
   * otherwise - use over-run character.
   ******************************************************************/

  nrf_spi_txd_set(p_spi,
                  (p_xfer_desc->tx_length > 0 ?  p_xfer_desc->p_tx_buffer[0] : priv->orc));

  /* TXD register is double buffered, so next byte to be transmitted can
   * be written immediately, if needed, i.e. if TX or RX transfer is to
   * be more that 1 byte long. Again - if there is something more in TX
   * buffer send it, otherwise use over-run character.
   *******************************************************************/

  if (p_xfer_desc->tx_length > 1)
    {
      nrf_spi_txd_set(p_spi, p_xfer_desc->p_tx_buffer[1]);
    }
  else if (p_xfer_desc->rx_length > 1)
    {
      nrf_spi_txd_set(p_spi, priv->orc);
    }

#ifdef CONFIG_NRF52_SPI_INTERRUPTS

  /* enable interrupt and start task */

  nrf_spi_int_enable(p_spi, NRF_SPI_INT_READY_MASK);

  /* if there is interrupt , just wait the semephore
   * potential issue: if interrupt missing , no post action
   */

  sem_wait(&priv->wait);

#else

  do
    {
      while (!nrf_spi_event_check(p_spi, NRF_SPI_EVENT_READY)) {}
      nrf_spi_event_clear(p_spi, NRF_SPI_EVENT_READY);
      spiinfo("SPI: Event: NRF_SPI_EVENT_READY.");
    }
  while (transfer_byte(priv, p_spi));

#endif

  err_code = OK;
  return err_code;
}

/******************************************************************************
 * Name: nrf_drv_spi_transfer
 *
 * Description:
 *   Take the exclusive access, waiting as necessary
 *
 *****************************************************************************/
static ret_code_t nrf_legacy_spi_transfer(FAR struct legacy_spidev_s *priv,
                                          uint8_t const *p_tx_buffer,
                                          uint32_t        tx_buffer_length,
                                          uint8_t        *p_rx_buffer,
                                          uint32_t        rx_buffer_length)
{
  priv->xfer_desc.p_tx_buffer = p_tx_buffer;
  priv->xfer_desc.p_rx_buffer = p_rx_buffer;
  priv->xfer_desc.tx_length   = tx_buffer_length;
  priv->xfer_desc.rx_length   = rx_buffer_length;
  priv->transferred = 0;
  return nrf_spi_xfer(priv, (NRF_SPI_Type *)priv->base, &priv->xfer_desc);
}

#ifdef CONFIG_NRF52_SPI_INTERRUPTS

/****************************************************************************
 * Name: legacy_spi_interrupt
 *
 * Description:
 *   The SPI Interrupt Handler
 *
 ****************************************************************************/
static int legacy_spi_interrupt_handler(int irq, void *context, FAR void *arg)
{
  struct legacy_spidev_s *dev = (struct legacy_spidev_s *)arg;

  NRF_SPI_Type *p_spi = (NRF_SPI_Type *)dev->base;

  if (nrf_spi_event_check(p_spi, NRF_SPI_EVENT_READY))
    {
      irqinfo("SPI: Ready Event.\n");

      nrf_spi_event_clear(p_spi, NRF_SPI_EVENT_READY);

      if (!transfer_byte(dev, p_spi))
        {
          /* Signal that the transfer is complete */

          sem_post(&(dev->wait));
        }
    }

  return OK;
}

#endif

/******************************************************************************
 * Name: legacy_spi_reset
 *
 * Description:
 *   Perform an SPI bus reset in an attempt to break loose stuck SPI devices.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 *****************************************************************************/

#ifdef CONFIG_SPI_RESET
static int legacy_spi_reset(struct spi_dev_s *dev)
{
  return OK;
}
#endif /* CONFIG_SPI_RESET */

/*****************************************************************************
 * Public Functions
 ****************************************************************************/
static int32_t nrf_legacy_spi_init(struct legacy_spidev_s *dev)
{
  uint32_t mosi_pin;
  uint32_t miso_pin;
  ret_code_t err_code;
  NRF_SPI_Type *p_spi = (NRF_SPI_Type *)dev->base;
  struct spi_pinmux_t *p_pinmux = dev->pinmux;

  ASSERT(dev);

  if (dev->state != NRF_DRV_STATE_UNINITIALIZED)
    {
      err_code = EINVAL;
      return err_code;
    }

  /* Configure pins used by the peripheral:
   * - SCK - output with initial value corresponding with the SPI mode used:
   *   0 - for modes 0 and 1 (CPOL = 0), 1 - for modes 2 and 3 (CPOL = 1);
   *   according to the reference manual guidelines this pin and its input
   *   buffer must always be connected for the SPI to work.
   */

