zglue/zglue_nuttx/arch/arm/src/nrf52/nrf52_spi_legacy.c
  if (dev->mode <= NRF_SPI_MODE_1)
    {
      nrf52_gpio_write(p_pinmux->sck_pin, false);
    }
  else
    {
      nrf52_gpio_write(p_pinmux->sck_pin, true);
    }

  nrf52_gpio_config(p_pinmux->sck_pin);

  /* - MOSI (optional) - output with initial value 0 */

  if (p_pinmux->mosi_pin != NRF52_INVALID_GPIO_PIN)
    {
      mosi_pin = p_pinmux->mosi_pin;
      nrf52_gpio_write(mosi_pin, false);
      nrf52_gpio_config(mosi_pin);
    }
  else
    {
      mosi_pin = NRF_SPI_PIN_NOT_CONNECTED;
    }

  /* - MISO (optional) - input */

  if (p_pinmux->miso_pin != NRF52_INVALID_GPIO_PIN)
    {
      miso_pin = p_pinmux->miso_pin;
      nrf_gpio_cfg_input(miso_pin, GPIO_PIN_CNF_PULL_Pulldown);
    }
  else
    {
      miso_pin = NRF52_INVALID_GPIO_PIN;
    }

#ifndef CONFIG_NRF52_CS_CONTROL_BY_USER
  /* - Slave Select (optional) - output with initial value 1 (inactive). */

  if (p_pinmux->cs_pin != NRF52_INVALID_GPIO_PIN)
    {
      nrf52_gpio_write(p_pinmux->cs_pin, true);
      nrf52_gpio_config(p_pinmux->cs_pin);
    }
#endif

  nrf_spi_pins_set(p_spi, p_pinmux->sck_pin, mosi_pin, miso_pin);
  nrf_spi_frequency_set(p_spi, (nrf_spi_frequency_t)dev->frequency);
  nrf_spi_configure(p_spi,
                    (nrf_spi_mode_t)dev->mode,
                    (nrf_spi_bit_order_t)dev->bit_order);

  dev->state = NRF_DRV_STATE_INITIALIZED;

  return OK;
}

#ifdef CONFIG_NRF52_CS_CONTROL_BY_USER
FAR int nrf52_spibus_register(SPI_CS_CallBack cs_select)
{
  g_cs_select = cs_select;
  return OK;
}
#endif

/****************************************************************************
 * Name: legacy_spibus_initialize
 *
 * Description:
 *   Initialise an SPI device
 *
 ****************************************************************************/

struct spi_dev_s *legacy_spibus_initialize(int port)
{
  struct legacy_spidev_s *priv = NULL;
  if (port > 2)
    {
      spierr("ERROR: NRF52 SPI Only supports ports 0 and 1 & 2\n");
      return NULL;
    }

  irqstate_t flags;
  int32_t err_code;

#ifdef CONFIG_NRF52_LEGACY_SPI0
  if (port == 0)
    {
      priv = &g_spi0;
    }
#endif

#ifdef CONFIG_NRF52_LEGACY_SPI1
  if (port == 1)
    {
      priv = &g_spi1;
    }
#endif

#ifdef CONFIG_NRF52_LEGACY_SPI2
  if (port == 2)
    {
      priv = &g_spi2;
    }
#endif

  if (NULL == priv)
    {
      spierr("Wrong Parameter or Config Error, Please Check !!!\n");
      return NULL;
    }

  err_code = nrf_legacy_spi_init(priv);

  if (err_code != OK)
    {
      return NULL;
    }

  /* Initialize semaphores */

  sem_init(&priv->mutex, 0, 1);

#ifdef CONFIG_NRF52_SPI_INTERRUPTS
  sem_init(&priv->wait, 0, 0);

  /* The wait semaphore is used for signaling and, hence, should not have
   * priority inheritance enabled.
  */
  sem_setprotocol(&priv->wait, SEM_PRIO_NONE);
#endif

  flags = enter_critical_section();

#ifdef CONFIG_NRF52_SPI_INTERRUPTS

  /* Attach Interrupt Handler */
  irq_attach(priv->irqid, priv->isr, priv);

  /* Enable Interrupt Handler */
  up_enable_irq(priv->irqid);
#endif

  leave_critical_section(flags);

  /* Enable SPI */

  nrf_spi_enable((NRF_SPI_Type *)priv->base);

  return &(priv->spidev);
}



/****************************************************************************
 * Name: legacy_spibus_uninitialize
 *
 * Description:
 *   Uninitialise an SPI device
 *
 ****************************************************************************/

int legacy_spibus_uninitialize(FAR struct spi_dev_s *dev)
{
  struct legacy_spidev_s *priv = (struct legacy_spidev_s *) dev;
  irqstate_t flags;

  ASSERT(priv->state != NRF_DRV_STATE_UNINITIALIZED);

  /* Disable SPI */
  nrf_spi_disable((NRF_SPI_Type *)priv->base);

  /* Reset data structures */

  sem_destroy(&priv->mutex);
#ifdef CONFIG_NRF52_SPI_INTERRUPTS
  sem_destroy(&priv->wait);
#endif

  flags = enter_critical_section();

  /* Disable interrupts */

  up_disable_irq(priv->irqid);

  /* Detach Interrupt Handler */

  irq_detach(priv->irqid);

  leave_critical_section(flags);

  priv->state = NRF_DRV_STATE_UNINITIALIZED;
  return OK;
}

/****************************************************************************
 * Name: legacy_spi_send
 *
 * Description:
 *   Set the frequency for the next transfer
 *
 ****************************************************************************/
static uint16_t legacy_spi_send(FAR struct spi_dev_s *dev, uint16_t wd)
{
  FAR struct legacy_spidev_s *priv = (struct legacy_spidev_s *)dev;
  uint8_t response = 0;
  uint8_t cmd;

  cmd = (uint8_t)wd;

  response = 0;

  /* issue here:
   *    spi_send should return the response data , but there is bug
   *    if use nrf_drv_spi_transfer(priv, &cmd, 1, &response, 1) to get response
   *    nordic will send out two command, bus data is wrong.
   *    Should get workaround in further
   */

  nrf_legacy_spi_transfer(priv, &cmd, 1, &response, 1);

  spiinfo("Legacy: Cmd: %02#x. Response: %02#x\n", cmd, response);

  return (uint16_t)response;
}

#ifdef CONFIG_SPI_EXCHANGE
/************************************************************************************
 * Name: legacy_spi_exchange
 *
 * Description:
 *   Release exclusive access
 *
 ************************************************************************************/
static void legacy_spi_exchange(FAR struct spi_dev_s *dev,
                                      FAR const void *txbuffer,
                                      FAR void *rxbuffer, size_t nwords)
{
  FAR struct legacy_spidev_s *priv = (struct legacy_spidev_s *)dev;

  spiinfo("Legacy: Exchange: size %d.\n", nwords);

  nrf_legacy_spi_transfer(priv, (uint8_t const *)txbuffer,
                         nwords, (uint8_t *)rxbuffer, nwords);

}

#else
/****************************************************************************
 * Name: legacy_spi_sndblock
 *
 * Description:
 *   Set the frequency for the next transfer
 *
 ****************************************************************************/
static void legacy_spi_sndblock(FAR struct spi_dev_s *dev,
                                      FAR const void *txbuffer, size_t nwords)
{
  FAR struct legacy_spidev_s *priv = (struct legacy_spidev_s *)dev;

  spiinfo("Legacy: Sndblock: size %d.\n", nwords);

  nrf_legacy_spi_transfer(priv, (uint8_t const *)txbuffer, nwords, NULL, 0);

}

/****************************************************************************
 * Name: legacy_spi_recvblock
 *
 * Description:
 *   Set the frequency for the next transfer
 *
 ****************************************************************************/
static void legacy_spi_recvblock(FAR struct spi_dev_s *dev,
                                        FAR void *rxbuffer, size_t nwords)
{
  FAR struct legacy_spidev_s *priv = (struct legacy_spidev_s *)dev;

  spiinfo("Recvblock: size %d.\n", nwords);

  nrf_legacy_spi_transfer(priv, NULL, 0, (uint8_t const *)rxbuffer, nwords);

}

#endif

#endif /*CONFIG_NRF52_LEGACY_SPI0 CONFIG_NRF52_LEGACY_SPI1 CONFIG_NRF52_LEGACY_SPI2 */

